TheTravels/STM32F4_CDC_MSC/F4/BL_App/components/driver/ec20.c
/******************** (C) COPYRIGHT 2015 merafour ********************
* File Name          : ec20.c
* Author             : 冷月追风 && Merafour
* Version            : V1.0.0
* Last Modified Date : 07/10/2020
* Description        : 移远 EC20 模块驱动.
********************************************************************************
* https://merafour.blog.163.com
* merafour@163.com
* https://github.com/merafour
*******************************************************************************/
#include <stdio.h>
#include <ctype.h>
#include "ec20.h"
#include "at.h"
#include "main.h"
#include "Periphs/uart.h"
#include "stm32f4xx_hal.h"

static const char ReturnOK[] = "\r\nOK";
static const char ReturnERROR[] = "\r\nERROR";
static const char ReturnSENDFAIL[]="SEND FAIL";
static const char ReturnA[] = ">";

static const char ReturnPdpDeactivation[] = "\r\n+QIURC: \"pdpdeact\",";
static const char ReturnSocket_closed[] = "\r\n+QIURC: \"closed\",";
static const char ReturnRecv[] = "\r\n+QIURC: \"recv\",";

//static char _ccm __attribute__ ((aligned (4))) ec20_data[1024*4];

#if 1
struct ec20_ofps _ccm __attribute__ ((aligned (4))) _ec20_ofps;
#else
struct ec20_ofps _ccm __attribute__ ((aligned (4))) _ec20_ofps = {
		._at = {
				.uart_send = uart1_send,
				.uart_read = uart1_read,
				.uart_size = uart1_size,
				.uart_is_empty = uart1_isempty,
		},
		.NetInfo = {
				.NADR = "39.108.51.99",
				.PORT = 9919,
				.APN  = "UNIM2M.NJM2MAPN",
				.IP   = "",
				.NUSER = "",
				.NPWD = "",
				.mult = 0,
		},
};
#endif

/*
判断指定字符串是否全为字母数字
*/
int checkAlNum(const char *const str, const uint16_t len)
{
	uint16_t i;
	for(i=0;i<len;i++)
	{
		if(0==isalnum(str[i])) return 0;
	}
	return 1;
}

enum ec20_resp EC20_Reset(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret = EC20_RESP_OK;
	int resp;
	// 状态重置
	_ofps->ModuleState = EC20_MODULE_RESET;
	_ofps->State.b.Connected = 0;
	_ofps->State.b.ReConnect = 1;
    _ofps->State.b.CPIN = 0;
    _ofps->State.b.ReqSetGNSS=1; // gnss重新设置
    _ofps->State.b.ReqSetWifi=1; // wifi重新设置
    // 发送关机指令
    at_print("AT+QPOWD=0\r\n");  // shotdown
    // 接收响应
    at_get_resps(ReturnOK, ReturnERROR, NULL, 3000, 100, &_ofps->_at);

    //app_debug("[%s-%d] AT<-- [%s] \r\n", __func__, __LINE__, _ofps->data);
    app_debug("[%s-%d] reboot EC20 ...\r\n", __func__, __LINE__);
    // 模块重新上电
    LL_GPIO_ResetOutputPin(PWR_EN_4G_GPIO_Port, PWR_EN_4G_Pin);
    HAL_Delay(2500);
    USART1_Init(115200);
    HAL_Delay(100);
    LL_GPIO_SetOutputPin(PWR_EN_4G_GPIO_Port, PWR_EN_4G_Pin);
    //
    _ofps->ModuleState = EC20_MODULE_SET;
    HAL_Delay(7000);  // 7s, 模块需要 10s 左右的时间来启动
    //resp = GetResponse("\r\nRDY\r\n", ReturnOK, 10000);
    // "\r\nRDY\r\n" 表示设备已正常启动
    app_debug("[%s-%d] read RDY ...\r\n", __func__, __LINE__);
    resp = at_get_resps("\r\nRDY\r\n", NULL, NULL, 10000, 100, &_ofps->_at);
    if(0!=resp)
    {
    	app_debug("[%s-%d] EC20 reboot timeout!\r\n", __func__, __LINE__);
    }

    return ret;
}

enum ec20_resp EC20_Set(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret = EC20_RESP_OK;
    //COMM_GPRS *module = (COMM_GPRS *)p;
    int resp;
    uint8_t state;
    uint8_t err;

    _ofps->State.b.CPIN = 0;
    //_ofps->socket2 = 0;
    state = 0;
    err = 3;
#if 1
    at_print("AT+IPR=460800\r\n");// 更改波特率
    USART1_Init(460800);
    HAL_Delay(500);
#endif
    while(err && (state != 0xFF))
    {
    	switch(state)
    	{
    	case 0:
    		at_print("ATE0\r\n");//("ATE0\r")
    		//resp = GetResponse(ReturnOK, ReturnERROR, 3000);
    		resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 3000, 100, &_ofps->_at);
    		if(0 == resp)
    		{
    			err = 3;
    			state = 1;
    		}
    		else
    		{
    			app_debug("---ATE0 response error!\r\n");
    			err--;
    		}
    		break;
    	case 2:
    		at_print("AT+CCID\r\n");
    		//resp = GetResponse(ReturnOK, ReturnERROR, 3000);
    		resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 3000, 100, &_ofps->_at);
    		if(0 == resp)
    		{
    			state = 0xFF;
    		}
    		else
    		{
    			HAL_Delay(10000);
    			app_debug("---AT+CCID response error!\r\n");
    			err--;
    		}
    		break;
    	case 1:
    		at_print("AT+CPIN?\r\n");  // 检测 SIM卡
    		//resp = GetResponse(ReturnOK, ReturnERROR, 3000);
    		// 检测到 SIM卡返回 "+CPIN: READY"
    		//resp = GetResponse("+CPIN: READY", ReturnERROR, 3000);
    		resp = at_get_resps("+CPIN: READY", ReturnERROR, NULL, 3000, 100, &_ofps->_at);
    		if(0 == resp)
    		{
    			//state = 0xFF;
    			state = 2;
    			_ofps->State.b.CPIN = 1;
    		}
    		else
    		{
    			HAL_Delay(10000);
    			app_debug("---AT+CCID response error!\r\n");
    			err--;
    		}
    		break;
    	default:
    		state = 0;
    		break;
    	}
    	HAL_Delay(300);
    }

    if(0 == err)
    {
    	_ofps->ModuleState = EC20_MODULE_RESET;
    	ret=EC20_RESP_ERROR;
    }
    else
    {
    	_ofps->ModuleState = EC20_MODULE_CHK_REG;
    	_ofps->State.b.PowerOn = 1;
    }
    return ret;
}
enum ec20_resp EC20_CheckRegister(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;
    uint8_t state;
    uint8_t err;
    uint8_t time_out = 0;

    state = 0;
    err = 3;
    while(err && (state != 0xFF))
    {
        switch(state)
        {
            case 0:
            	at_print("AT+CREG?\r");
                //resp = GetResWithCheck(ReturnOK, ReturnERROR, 1000);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 1000, 100, &_ofps->_at);
                if(0 == resp)
                {
                    //char *pStr;
                    int stat=-1;
                    //app_debug("\r\n[%s-%d] _rbuf:<\r\n%s> \r\n", __func__, __LINE__, _ofps->_at._rbuf);
                    // +CREG: <n>,<stat>[,<sid>,<nid_bid>,<Act>]
                    at_get_resp_split_int(_ofps->_at._rbuf, "+CREG: ", &stat, ',', 2);
#if 0
                    pStr = strstr(_ofps->_at._rbuf, "+CREG: ");
                    if(NULL == pStr)
                    {
                      err--;
                      break;
                    }
                    if((pStr[9] == '1') || (pStr[9] == '5'))//已注册
                    {
                        state = 1;
                    }
                    else
                    {
                        time_out++;
                        HAL_Delay(1000);
                    }
#else
                    if((1==stat) || (5==stat))//已注册
                    {
                        state = 1;
                    }
                    else
                    {
                        time_out++;
                        HAL_Delay(1000);
                        if((0<=stat) && (stat<5))
                        {
                        	const char* const _stat[] = {
                        			"0:Not registered. ME is not currently searching a new operator to register to",
                        			"1:Registered, home network",
                        			"2:Not registered, but ME is currently searching a new operator to register to" ,
                        			"3:Registration denied",
                        			"4:Unknown",
                        			"5:Registered, roaming"
                        	};
                        	app_debug("\r\n[%s-%d] _stat:<%s> \r\n", __func__, __LINE__, _stat[stat]);
                        }
                    }
#endif
                }
                else
                {
                	app_debug("---AT+CREG? response error!\r\n");
                    err--;
                }
                break;
            case 1:
            	at_print("AT+CGATT?\r");
                //resp = GetResWithCheck(ReturnOK, ReturnERROR, 4000);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 4000, 100, &_ofps->_at);
                if(0 == resp)
                {
                    char *pStr;
                    pStr = strstr(_ofps->_at._rbuf, "+CGATT: ");
                    if(NULL == pStr)
                    {
                      err--;
                      break;
                    }
                    if(pStr[8] == '1')
                        state = 0xFF;
                    else
                    {
                        err = 3;
                        state = 2;
                    }
                }
                else
                {
                	app_debug("---AT+CGATT? response error!\r\n");
                    err--;
                }
                break;
            case 2:
            	at_print("AT+CGATT=1\r");
                //resp = GetResponse(ReturnOK, ReturnERROR, 4000);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 4000, 100, &_ofps->_at);
                if(0 <= resp)
                {
                    err = 3;
                    state = 1;
                }
                else
                {
                	app_debug("---AT+CGATT=1 response error!\r\n");
                    err--;
                }
                break;
            default:
                state = 0;
                break;
        }
        HAL_Delay(100);

        if(time_out > 20) // 200
            err = 0;
    }

    if(0 == err)
    {
#if 0
    	_ofps->ModuleState = EC20_MODULE_RESET;
        ret=EC20_RESP_ERROR;
#else       // 联通没有 2G网络
        _ofps->ModuleState = EC20_MODULE_PPP;
#endif
    }
    else
    {
    	_ofps->ModuleState = EC20_MODULE_PPP;
    }
    return ret;
}

enum ec20_resp EC20_Ppp(struct ec20_ofps* const _ofps, const char apn[], const char username[], const char password[])
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;
    uint8_t state;
    uint8_t err;
    uint8_t time_out = 0;

    state = 1;
    err = 3;
    while(err && (state != 0xFF))
    {
        switch(state)
        {
//                case 0:
//                    ModulePrintf("AT+CIPMUX?\r");//查询IP连接单路还是多路
//                    resp = GetResWithCheck(ReturnOK, ReturnERROR, 200);
//                    if(0 == resp)
//                    {
//                        char *pStr = rt_strstr((const char *)module->Line, "+CIPMUX: ");
//                        if(NULL != pStr)
//                        {
//                            if(pStr[9]=='1'){
//                                state = 11;
//                            }
//                            else{
//                                state = 10;
//                            }
//                            err = 3;
//                        }
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIPMUX? response error!\r\n");
//                        err--;
//                    }
//                    break;
            case 1:
            	// AT+QICSGP=<contextID>[,<context_type>,<APN>[,<username>,<password>)[,<authentication>]]]
            	at_print("AT+QICSGP=1,1,\"%s\",\"%s\",\"%s\",3\r", apn, username, password);//设置APN名字
                //resp = GetResponse(ReturnOK, ReturnERROR, 200);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 200, 100, &_ofps->_at);
                if(0 == resp)
                {
                    state = 0xff;
                }
                else
                {
                	app_debug("---AT+CSTT= response error!\r\n");
                    err--;
                }
                break;
//                case 2:
//                  {
//                    ModulePrintf("AT+QIACT=1\r");//激活移动场景
////                    resp = GetResponse(ReturnOK, ReturnERROR, 3000);
//                    const char *res[]={ReturnOK, ReturnERROR};
//                    resp=GetRes(res,sizeof(res)/sizeof(const char*),3000,2000);
//                    if(0 == resp)
//                    {
//                        err = 3;
//                        state = 3;
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIICR response error!\r\n");
//                        err--;
//                    }
//                  }
//                    break;
//                case 3:
//                   ModulePrintf("AT+CIFSR\r");//获得本地IP
////                    resp = GetRes(2000);
//                    resp =GetRes(0,0,2000,100);
//                    if(-1 != resp)
//                    {
//                        state = 0xFF;
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIFSR response error!\r\n");
//                        time_out++;
//                        err--;
//                    }
//                    break;
//                case 10://切换多路
//                   ModulePrintf("AT+CIPMUX=1\r");
//                    resp = GetResponse(ReturnOK, ReturnERROR, 2000);
//                    if(0 == resp)
//                    {
//                        err = 3;
//                        state = 0;
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIPMUX=1 response error!\r\n");
//                        err--;
//                    }
//                    break;
//                case 11://读状态
//                    ModulePrintf("AT+CIPSTATUS\r");
////                    resp = GetRes(2000);
//                    resp = GetRes(0,0,2000,100);
//                    if(-1 != resp)
//                    {
//                        if(RT_NULL != rt_strstr((const char *)CommGprs.Line,"IP INITIAL"))
//                        {
//                            err = 3;
//                            state = 12;
//                        }
//                        else
//                        {
//                            state = 0xFF;
//                        }
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIPSTATUS response error!\r\n");
//                        err--;
//                    }
//                    break;
//                case 12://
//                    ModulePrintf("AT+CIPRXGET=1\r");//手动接收数据
//                    resp = GetResponse(ReturnOK, ReturnERROR, 2000);
//                    if(0==resp)
//                    {
//                        state =1;
//                        err=3;
//                    }
//                    else
//                    {
//                        app_debug("---AT+CIPRXGET=1 response error!\r\n");
//                        err--;
//                    }
//                    break;
            default:
                state = 0;
                break;
        }
        HAL_Delay(30);

        if(time_out > 10)
            err = 0;
    }

    if(0 == err)
    {
    	_ofps->ModuleState = EC20_MODULE_RESET;
        ret=EC20_RESP_ERROR;
    }
    else
    {
    	_ofps->ModuleState = EC20_MODULE_GET_INFORMATION;
    }
    return ret;
}

