TheTravels/STM32F4_CDC_MSC/F4/BL_App/components/driver/ec20.c
enum ec20_resp EC20_GetInformation(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;
    uint8_t state;
    uint8_t err;
//    u8 i;
    //char *pStr;

    state = 0;
    err = 3;
    while(err && (state != 0xFF))
    {
        switch(state)
        {
            case 0:
            	at_print("AT+CGSN\r");
                //resp = GetResWithCheck(ReturnOK, ReturnERROR, 200);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 200, 100, &_ofps->_at);
                if(0 == resp)
                {
#if 0
                    pStr=&_ofps->_at._rbuf[2];
                    if(checkAlNum(pStr,LENTH_IMEI))
                    {
                      memcpy(_ofps->IMEI, pStr, LENTH_IMEI);
                      err = 3;
                      state = 1;
                    }
#else
                    char IMEI[32];
                    if(at_get_str_split(_ofps->_at._rbuf, IMEI, '\n', 2, sizeof(IMEI))>0)
                    {
                    	memcpy(_ofps->IMEI, IMEI, LENTH_IMEI);
                        err = 3;
                        state = 1;
                    }
#endif
                }
                else
                {
                	app_debug("---AT+CGSN error!\r\n");
                    err--;
                }
                break;
            case 1:
            	at_print("AT+CCID\r");
                //resp = GetResWithCheck(ReturnOK, ReturnERROR, 2000);
            	resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 200, 100, &_ofps->_at);
                if(0 == resp)
                {
#if 0
                    pStr=&_ofps->_at._rbuf[9];
                    if(checkAlNum(pStr, LENTH_SIM))
                    {
                      memcpy(_ofps->SIM, pStr, LENTH_SIM);
                      state = 0xFF;
                    }
#else
                    char SIM[32];
                    if(at_get_resp_split(_ofps->_at._rbuf, "+CCID: ", SIM, sizeof(SIM))>0)
                    {
                      memcpy(_ofps->SIM, SIM, LENTH_SIM);
                      state = 0xFF;
                    }
#endif
                }
                else
                {
                	app_debug("---AT+CCID error!\r\n");
                    err--;
                }
                break;
            default:
                state = 0;
                break;
        }
        HAL_Delay(30);
    }

    if(0 == err)
    {
    	_ofps->ModuleState = EC20_MODULE_RESET;
        ret=EC20_RESP_ERROR;
    }
    else
    {
    	_ofps->ModuleState = EC20_MODULE_CONNECT;
    }

    return ret;
}
enum ec20_resp EC20_Connect(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;
    uint8_t state;
    uint8_t err;
   // char *pStr;
    char *addr;
    uint8_t time_out = 0;
    int socket;
    int ErrCode;

    state = 0;
    err = 3;
    while(err && (state != 0xFF))
    {
        switch(state)
        {
            case 0:
              {
            	  at_print("AT+QIACT?\r");//激活移动场景
//                    resp = GetResponse(ReturnOK, ReturnERROR, 3000);
                //const char *res[]={"+QIACT: 1,",ReturnOK,ReturnERROR};
                //resp=GetRes(res,sizeof(res)/sizeof(const char*),3000,2000);
                resp = at_get_resps("+QIACT: 1,", ReturnOK, ReturnERROR, 3000, 200, &_ofps->_at);
                if(0 == resp)
                {
                    err = 3;
                    state = 2;
                }
                else if(1 == resp)
                {
                    err = 3;
                    state = 1;
                }
                else
                {
                    app_debug("---AT+QIACT? response error!\r\n");
                    err--;
                }
              }
                break;
            case 1:
              {
            	  at_print("AT+QIACT=1\r");//激活移动场景
//                    resp = GetResponse(ReturnOK, ReturnERROR, 3000);
                //const char *res[]={ReturnOK, ReturnERROR};
                //resp=GetRes(res,sizeof(res)/sizeof(const char*),3000,2000);
                resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 3000, 200, &_ofps->_at);
                if(0 == resp)
                {
                    err = 3;
                    state =2;
                }
                else if(resp==1){
                    err=3;
                    state=4;
                }
                else
                {
                    app_debug("---AT+QIACT=1 response error!\r\n");
                    err--;
                }
              }
                break;
            case 2:
              {
                  addr=_ofps->NetInfo.IP;
                  if(0 != strlen((char const*)_ofps->NetInfo.NADR))
                  {
                     addr=_ofps->NetInfo.NADR;
                  }

                  const char *res[]={"+QIOPEN: 0,"};
                  at_print("AT+QIOPEN=1,%d,\"TCP\",\"%s\",%d,0,0\r",
                		  _ofps->SocketID,addr, _ofps->NetInfo.PORT);

                  //resp=GetResWait1(res,sizeof(res)/sizeof(const char*),15000,100);
//                      resp = GetResWithCheck(ReturnOK, ReturnERROR,4000);
//                      resp = GetRes(0,0,4000,2000);
                  resp = at_get_resps("+QIOPEN: 0,", NULL, NULL, 15000, 200, &_ofps->_at);
                  if(resp==0)
                  {
                        char *pStr= strstr((const char *)_ofps->_at._rbuf, res[0]);
                        if(NULL == pStr)
                        {
                          err--;
                          break;
                        }
#if 0
                        if(pStr[11]=='0'){
                            state =0xff;
                            // 多路 TCP连接
                            if(module->Net2.PORT>1024) state = 3;
                        }
                        else{
                            err--;
                            break;
                        }
#else
                        // +QIOPEN: <connectID>,<err>
                        sscanf(pStr, "+QIOPEN: %d,%d", &socket, &ErrCode);
                        if(563==ErrCode) // ErrCode 563:Socket identity has been used
                        {
                        	at_print("AT+QICLOSE=%d\r", _ofps->SocketID);
                            //resp = GetResponse("OK\r\n", ReturnERROR, 3000);
                        	resp = at_get_resps("OK\r\n", ReturnERROR, NULL, 3000, 200, &_ofps->_at);
                            err--;
                        }
                        // 0:Operation successful
                        else if(0==ErrCode)//if(pStr[11]=='0')
                        {
                            state =0xff;
                            // 多路 TCP连接
                            if(_ofps->Net2.PORT>1024) state = 3;
                        }
                        else
                        {
                            err--;
                            break;
                        }
#endif
                  }
                  else
                  {
                    app_debug("---AT+QIOPEN= error!\r\n");
                    err--;
                  }
              }
              break;
            case 3: // 多路 TCP连接
              {
                  addr=_ofps->Net2.IP;
                  if(0 != strlen((char const*)_ofps->Net2.NADR))
                  {
                     addr=_ofps->Net2.NADR;
                  }
                  _ofps->socket2 = _ofps->SocketID + 1;
                  const char *res[]={"+QIOPEN: 1,"};
                  at_print("AT+QIOPEN=1,%d,\"TCP\",\"%s\",%d,0,0\r",
                		  _ofps->socket2,addr,_ofps->Net2.PORT);

                  //resp=GetResWait1(res,sizeof(res)/sizeof(const char*),15000,100);
//                      resp = GetResWithCheck(ReturnOK, ReturnERROR,4000);
//                      resp = GetRes(0,0,4000,2000);
                  resp = at_get_resps("+QIOPEN: 1,", NULL, NULL, 15000, 200, &_ofps->_at);
                  if(resp==0)
                  {
                        char *pStr= strstr((const char *)_ofps->_at._rbuf, res[0]);
                        if(NULL == pStr)
                        {
                          err--;
                          break;
                        }
                        // +QIOPEN: <connectID>,<err>
                        sscanf(pStr, "+QIOPEN: %d,%d", &socket, &ErrCode);
                        if(563==ErrCode) // ErrCode 563:Socket identity has been used
                        {
                        	at_print("AT+QICLOSE=%d\r", _ofps->socket2);
                            //resp = GetResponse("OK\r\n", ReturnERROR, 3000);
                            resp = at_get_resps("OK\r\n", ReturnERROR, NULL, 3000, 200, &_ofps->_at);
                            err--;
                        }
                        // 0:Operation successful
                        else if(0==ErrCode)//if(pStr[11]=='0')
                        {
                            state =0xff;
                        }
                        else
                        {
                            err--;
                            break;
                        }
                  }
                  else
                  {
                    app_debug("---AT+QIOPEN= error!\r\n");
                    err--;
                  }
              }
              break;
             case 4:
              {
            	  at_print("AT+QIDEACT=1\r");//激活移动场景
//                    resp = GetResponse(ReturnOK, ReturnERROR, 3000);
                //const char *res[]={ReturnOK, ReturnERROR};
                //resp=GetRes(res,sizeof(res)/sizeof(const char*),3000,2000);
                resp = at_get_resps(ReturnOK, ReturnERROR, NULL, 3000, 200, &_ofps->_at);
                if(0 == resp)
                {
                    state =0xff;
                }
                else
                {
                    app_debug("---AT+QIDEACT=1 response error!\r\n");
                    err--;
                }
              }
                break;
            default:
                state = 0;
                break;
        }
        HAL_Delay(100);

        if(time_out > 10)
            err = 0;
    }

    if(0 == err)
    {
    	_ofps->ModuleState = EC20_MODULE_DISCONNECT;
        ret=EC20_RESP_ERROR;
    }
    else
    {
    	_ofps->State.b.Connected = 1;
    	_ofps->ModuleState = EC20_MODULE_IDLE;
    }

    return ret;
}
enum ec20_resp EC20_Disconnect(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;
    uint8_t state;
    uint8_t err;

    state = 0;
    err = 3;
    while(err && (state != 0xFF))
    {
    	at_print("AT+QICLOSE=%d\r", _ofps->SocketID);
        //resp = GetResponse("OK\r\n", ReturnERROR, 3000);
    	resp = at_get_resps("OK\r\n", ReturnERROR, NULL, 3000, 200, &_ofps->_at);
        if(0 <= resp)
        {
            state = 0xFF;
        }
        else
        {
            app_debug("---AT+CIPCLOSE= error!\r\n");
            err--;
            HAL_Delay(30);
        }
    }
    err = 3;
    while((_ofps->socket2>0) && err && (state != 0xFF))
    {
    	at_print("AT+QICLOSE=%d\r", _ofps->socket2);
        //resp = GetResponse("OK\r\n", ReturnERROR, 3000);
    	resp = at_get_resps("OK\r\n", ReturnERROR, NULL, 3000, 200, &_ofps->_at);
        if(0 <= resp)
        {
            state = 0xFF;
            _ofps->socket2 = 0;
        }
        else
        {
            app_debug("---AT+CIPCLOSE= error!\r\n");
            err--;
            HAL_Delay(30);
        }
    }
    HAL_Delay(30);
    if(0 == err)
    {
    	_ofps->ModuleState = EC20_MODULE_RESET;
        ret=EC20_RESP_ERROR;
    }
    else
    {
    	_ofps->ModuleState = EC20_MODULE_SET;
    }

    return ret;
}
enum ec20_resp EC20_Idle(struct ec20_ofps* const _ofps)
{
	enum ec20_resp ret=EC20_RESP_OK;
    int resp;

