TheTravels/STM32F4_CDC_MSC/F4/BL_App/components/driver/ec20.c
enum ec20_resp EC20_Init(void)
{
	enum ec20_resp ret;
	int resp;
	at_ofps_init(&_ec20_ofps._at);
	strcpy(_ec20_ofps.NetInfo.NADR, "39.108.51.99");
	_ec20_ofps.NetInfo.PORT = 9919;
	strcpy(_ec20_ofps.NetInfo.APN, "UNIM2M.NJM2MAPN");
	strcpy(_ec20_ofps.NetInfo.NUSER, "");
	strcpy(_ec20_ofps.NetInfo.NPWD, "");
	//app_debug("[%s--%d] EC20 Test Start!\r\n", __func__, __LINE__);
    app_debug("[%s-%d] read RDY ...\r\n", __func__, __LINE__);
    resp = at_get_resps("\r\nRDY\r\n", NULL, NULL, 12000, 1000, &_ec20_ofps._at);
	if(0!=resp) EC20_Reset(&_ec20_ofps);
	//app_debug("[%s-%d] EC20_Set ...\r\n", __func__, __LINE__);
	ret = EC20_Set(&_ec20_ofps);
	//app_debug("[%s-%d] EC20_CheckRegister ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_CheckRegister(&_ec20_ofps);
	app_debug("[%s-%d] EC20_Ppp ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_Ppp(&_ec20_ofps, "UNIM2M.NJM2MAPN", "", "");
	app_debug("[%s-%d] EC20_GetInformation ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_GetInformation(&_ec20_ofps);
	return ret;
}

char data[1024*20];
void EC20_Test(void)
{
	enum ec20_resp ret;
	//char data[1024];
	int resp;
	uint32_t tick_start = HAL_GetTick();
	uint32_t tick_end;
	at_ofps_init(&_ec20_ofps._at);
	strcpy(_ec20_ofps.NetInfo.NADR, "39.108.51.99");
	_ec20_ofps.NetInfo.PORT = 9919;
	strcpy(_ec20_ofps.NetInfo.APN, "UNIM2M.NJM2MAPN");
	strcpy(_ec20_ofps.NetInfo.NUSER, "");
	strcpy(_ec20_ofps.NetInfo.NPWD, "");
	//app_debug("[%s--%d] EC20 Test Start!\r\n", __func__, __LINE__);
    app_debug("[%s-%d] read RDY ...\r\n", __func__, __LINE__);
    resp = at_get_resps("\r\nRDY\r\n", NULL, NULL, 12000, 1000, &_ec20_ofps._at);
    /*at_print("AT+QPRTPARA=3\r\n");
    at_get_resps("\r\nOK", NULL, NULL, 5000, 100, &_ec20_ofps._at);
    for(int i=0; i<30; i++)
    {
    	app_debug("[%s-%d] watting ...%d\r\n", __func__, __LINE__, i);
    	HAL_Delay(1000);
    }*/
	if(0!=resp) EC20_Reset(&_ec20_ofps);
	//app_debug("[%s-%d] EC20_Set ...\r\n", __func__, __LINE__);
	ret = EC20_Set(&_ec20_ofps);
	//app_debug("[%s-%d] EC20_CheckRegister ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_CheckRegister(&_ec20_ofps);
	app_debug("[%s-%d] EC20_Ppp ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_Ppp(&_ec20_ofps, "UNIM2M.NJM2MAPN", "", "");
	app_debug("[%s-%d] EC20_GetInformation ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_GetInformation(&_ec20_ofps);
	app_debug("[%s-%d] EC20_Connect ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_Connect(&_ec20_ofps);
	app_debug("[%s-%d] EC20_Send ...\r\n", __func__, __LINE__);
	//if(EC20_RESP_OK==ret) ret = EC20_Send(&_ec20_ofps, "#####", 5);
	//if(EC20_RESP_OK==ret) ret = EC20_Read(&_ec20_ofps, NULL, 100);
	// 收发测试
	tick_start = HAL_GetTick();
	app_debug("[%s-%d] tick_start[%d] ...\r\n", __func__, __LINE__, tick_start);
	for(int i=0; i<30; i++)
	{
		uint16_t _rlen=0;
		memset(data, '0'+(i%10), sizeof(data));
		//if(EC20_RESP_OK==ret) ret = EC20_Send(&_ec20_ofps, data, sizeof(data)-1);
		ret = EC20_Send(&_ec20_ofps, data, 1024);
		memset(data, 0, sizeof(data));
		if(EC20_RESP_OK==ret) ret = EC20_Read(&_ec20_ofps, data, sizeof(data), &_rlen);
		//app_debug("[%s-%d] _rlen[%d] data:[%s]\r\n", __func__, __LINE__, _rlen, data);
		app_debug("[%s-%d] _rlen[%d] \r\n", __func__, __LINE__, _rlen);
	}
	tick_end = HAL_GetTick();
	app_debug("[%s-%d] tick_start[%d] tick_start[%d] time[%d] ms\r\n", __func__, __LINE__, tick_start, tick_end, tick_end-tick_start);
	HAL_Delay(500);
	app_debug("[%s-%d] EC20_Disconnect ...\r\n", __func__, __LINE__);
	if(EC20_RESP_OK==ret) ret = EC20_Disconnect(&_ec20_ofps);
}

/************************ (C) COPYRIGHT Merafour *****END OF FILE****/

